<section id="blogs">
    <div class="relative min-h-auto my-25">
        <h2 class="text-center mb-20">أخر الاخبار</h2>
        <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-x-10 gap-y-24  px-2 sm:px-5">
            <x-ui.blog-card title="أهمية التغذية السليمة في تعزيز جهاز المناعة" image="blog1.jpg"
                excerpt="تُعد التغذية السليمة أحد العوامل الأساسية التي تساهم في تعزيز جهاز المناعة، مما يساعد الجسم على مقاومة الأمراض والالتهابات. تناول الأطعمة الغنية بالفيتامينات والمعادن، مثل الفواكه والخضروات، يلعب دورًا حيويًا في دعم وظائف الجهاز المناعي." />
            <x-ui.blog-card title="دور الألياف الغذائية في تحسين صحة الجهاز الهضمي" image="blog2.jpg"
                excerpt="تلعب الألياف الغذائية دورًا مهمًا في تحسين صحة الجهاز الهضمي من خلال تعزيز حركة الأمعاء وتقليل خطر الإصابة بالإمساك. تناول الأطعمة الغنية بالألياف، مثل الحبوب الكاملة والفواكه، يساهم في الحفاظ على توازن البكتيريا النافعة في الأمعاء." />
            <x-ui.blog-card title="التغذية والوقاية من الأمراض المزمنة" image="blog3.jpg"
                excerpt="تُظهر الأبحاث أن التغذية الجيدة تلعب دورًا حاسمًا في الوقاية من الأمراض المزمنة مثل أمراض القلب والسكري. اتباع نظام غذائي متوازن يحتوي على الدهون الصحية، والبروتينات، والكربوهيدرات المعقدة يمكن أن يقلل من مخاطر الإصابة بهذه الأمراض." />
        </div>
    </div>
</section>
