{
    "Insufficient Balance.": "رصيدك غير كافٍ لإتمام العملية.",
    "You have exceeded the allowed daily transaction limit for your STC Pay account.": "لقد تجاوزت الحد اليومي المسموح به للمعاملات في حساب STC Pay.",
    "You have exceeded the maximum allowed transaction amount.": "لقد تجاوزت الحد الأقصى المسموح لمبلغ المعاملة.",
    "Connection timed out while waiting for response from STC Pay service.": "انتهت مهلة الاتصال أثناء انتظار الاستجابة من خدمة STC Pay.",
    "Invalid OTP": "رمز التحقق (OTP) غير صحيح.",
    "Mobile number is not registered to use the STC Pay service.": "رقم الجوال غير مسجل لاستخدام خدمة STC Pay.",
    "Please update your information using the STC Pay app before attempting payment.": "يرجى تحديث معلوماتك عبر تطبيق STC Pay قبل محاولة الدفع.",
    "The customer account status is invalid, please contact STC Pay support.": "حالة حساب العميل غير صالحة، يرجى التواصل مع دعم STC Pay.",
    "You have exhausted your OTP attempts, please wait 15 minutes then try again.": "لقد استنفدت محاولات إدخال رمز التحقق، يرجى الانتظار 15 دقيقة ثم المحاولة مرة أخرى.",
    "Please wait 60 seconds before attempting a new payment.": "يرجى الانتظار 60 ثانية قبل محاولة دفع جديدة.",
    "An unexpected error occurred, please try again.": "حدث خطأ غير متوقع، حاول مرة أخرى.",
    "Payment failed. Please try again.": "فشل الدفع. حاول مرة أخرى.",
    "The card number is invalid.": "رقم البطاقة غير صالح.",
    "The card has expired.": "انتهت صلاحية البطاقة.",
    "The CVC code is invalid.": "رمز التحقق غير صحيح.",
    "Please enter your phone number.": "يرجى إدخال رقم الجوال.",
    "Please enter the verification code.": "يرجى إدخال رمز التحقق.",
    "Please enter the CVC code.": "يرجى إدخال رمز التحقق (CVC).",
    "Please enter the expiry date.": "يرجى إدخال تاريخ الانتهاء.",
    "Please enter the card number.": "يرجى إدخال رقم البطاقة.",
    "Please enter the cardholder name.": "يرجى إدخال اسم حامل البطاقة.",
    "Please enter a valid phone number.": "يرجى إدخال رقم جوال صالح.",
    "The card number length is incorrect for the card type.": "طول رقم البطاقة غير صحيح لنوع البطاقة.",
    "The card type is not supported.": "نوع البطاقة غير مدعوم.",
    "Invalid format (MM / YY).": "تنسيق غير صالح (MM / YY).",
    "The phone number must start with 05 and be 10 digits.": "يجب أن يبدأ رقم الجوال بـ 05 وأن يكون مكونًا من 10 أرقام.",
    "Transaction declined by the bank.": "تم رفض المعاملة من قبل البنك.",
    "Cardholder name must be English letters only.": "يجب أن يكون اسم حامل البطاقة باللغة الإنجليزية فقط."
}
